IdeaRS.Connections
EndPlateOnFlangesData.BeamEndPlateOffsetLeft Property
Compatible with IDEA StatiCa 0.0
 Gets or sets the left offset of the beam end plate boundary in the vertical direction (the height of the plate). The size of the end plate is based on the circumscribed box of the column.
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public double BeamEndPlateOffsetLeft { get; set; }
Property Value
Type: Double
See Also
Reference
EndPlateOnFlangesData Class
IdeaRS.Connections.Data Namespace